## Various Parameters of pd.read_csv()

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("C:\\Users\\Dell\\Desktop\\_PANDAS_\\Data\\Fortune_10_day13.csv")
df.head(3)

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A        2.0        50.0
1  02-07-2019      1002.0     10     NaN        NaN        80.0
2  03-07-2019         NaN     10     NaN        3.0        60.0

### Reads only a fixed number of rows from the file.

In [32]:
df1 = pd.read_csv("C:\\Users\\Dell\\Desktop\\_PANDAS_\\Data\\Fortune_10_day13.csv",nrows=3)
df1

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A        2.0        50.0
1  02-07-2019      1002.0     10     NaN        NaN        80.0
2  03-07-2019         NaN     10     NaN        3.0        60.0

### Selects specific columns to load.

In [25]:
df2 = pd.read_csv("C:\\Users\\Dell\\Desktop\\_PANDAS_\\Data\\Fortune_10_day13.csv",usecols=[0,1,2])
df2.head(3)

         Date  Student ID  Class
0  01-07-2019      1001.0     10
1  02-07-2019      1002.0     10
2  03-07-2019         NaN     10

### Skips specific rows while reading the file.

In [23]:
df3 = pd.read_csv("C:\\Users\\Dell\\Desktop\\_PANDAS_\\Data\\Fortune_10_day13.csv",skiprows=2) 
df3.head(3)

   02-07-2019  1002.0  10 Unnamed: 3  Unnamed: 4  80.0
0  03-07-2019     NaN  10        NaN         3.0  60.0
1  06-07-2019     NaN  11        NaN         0.0   NaN
2  07-07-2019  1005.0  11          A         4.0   NaN

### Sets one column as the DataFrame index.

In [11]:
df4 = pd.read_csv("C:\\Users\\Dell\\Desktop\\_PANDAS_\\Data\\Fortune_10_day13.csv",index_col=0) 
df4.head(3)

            Student ID  Class Section  Study hrs  Percentage
Date
01-07-2019      1001.0     10       A        2.0        50.0
02-07-2019      1002.0     10     NaN        NaN        80.0
03-07-2019         NaN     10     NaN        3.0        60.0

### Specifies which row contains column names.

In [21]:
df5 = pd.read_csv("C:\\Users\\Dell\\Desktop\\_PANDAS_\\Data\\Fortune_10_day13.csv",header=4) 
df5.head(3)

   06-07-2019  Unnamed: 1  11 Unnamed: 3   0.0  Unnamed: 5
0  07-07-2019      1005.0  11          A   4.0         NaN
1  08-07-2019         NaN  11          D  10.0         NaN
2  09-07-2019      1007.0  12          B   4.0        80.0

### Provides custom column names.

In [15]:
pd.read_csv('C:\\Users\\Dell\\Desktop\\_PANDAS_\\Data\\Fortune_10_day13.csv', names = ['1','2','3','4','5','6','7'] ).head(4)

            1           2      3        4          5           6   7
0        Date  Student ID  Class  Section  Study hrs  Percentage NaN
1  01-07-2019      1001.0     10        A        2.0        50.0 NaN
2  02-07-2019      1002.0     10      NaN        NaN        80.0 NaN
3  03-07-2019         NaN     10      NaN        3.0        60.0 NaN